knewg/grocy_p4_esp32_terminal/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32p4"

# Flash size — JC1060P470C has 8 MB flash
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# OTA rollback
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# PSRAM — 200 MHz requires IDF_EXPERIMENTAL_FEATURES
CONFIG_SPIRAM=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=8192
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_SPIRAM_SPEED_200M=y

# LVGL PNG and MemFS support (MemFS drive letter 'M' = 77)
CONFIG_LV_USE_PNG=y
CONFIG_LV_USE_FS_MEMFS=y
CONFIG_LV_FS_MEMFS_LETTER=77

# LVGL rendering performance
# PPA (Pixel Processing Accelerator) — hardware fills/blending on ESP32-P4
CONFIG_LV_USE_PPA=y
CONFIG_LV_USE_PPA_IMG=y
# Cache-line alignment required for PPA DMA
CONFIG_LV_DRAW_BUF_ALIGN=64
# 60 fps render cadence (was 33 ms / ~30 fps)
CONFIG_LV_DEF_REFR_PERIOD=16

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=n

# Log
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y

# WiFi via ESP32-C6 co-processor using esp_wifi_remote + esp_hosted (SDIO)
# JC1060P470C SDIO pins: CLK=18 CMD=19 D0=14 D1=15 D2=16 D3=17 RST=54

# HTTP client
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=y

# SNTP
CONFIG_LWIP_SNTP_MAX_SERVERS=2

# Stack sizes
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=6144

# Task watchdog
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30

# Board hardware config
CONFIG_GROCY_BACKLIGHT_GPIO=23
CONFIG_GROCY_MIPI_DSI_PHY_LDO_CHAN=3
CONFIG_GROCY_PROVISIONED_BY_KCONFIG=n
